#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bplab/gh-actions-demo/runs/run-qGNkPEeX8cGHJbpY

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:119548518081:cluster/BPCalc-Stage]
aws_vpc.main: Refreshing state... [id=vpc-0505ebd4ac5f1e3a8]
aws_cloudwatch_log_group.bpcalc_stage_log_group: Refreshing state... [id=/ecs/BPCalc-Stage-app]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=myEcsTaskExecutionRole]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=myEcsTaskExecutionRole-20211121215654751700000001]
aws_ecs_task_definition.app: Refreshing state... [id=BPCalc-task]
aws_cloudwatch_log_stream.bpcalc_stage_log_stream: Refreshing state... [id=BPCalc-Stage-log-stream]
aws_internet_gateway.gw: Refreshing state... [id=igw-099c275c5e220ade3]
aws_subnet.private[0]: Refreshing state... [id=subnet-02fb27c18a4431755]
aws_security_group.lb: Refreshing state... [id=sg-0b575e069f77939d7]
aws_subnet.public[0]: Refreshing state... [id=subnet-0fc00b1d35b6ac97f]
aws_subnet.private[1]: Refreshing state... [id=subnet-09266f463901736fd]
aws_subnet.public[1]: Refreshing state... [id=subnet-05035389b316e29b4]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:119548518081:targetgroup/BPCalc-Stage-TG/a4ff0a7441c913a6]
aws_eip.gw[0]: Refreshing state... [id=eipalloc-0609c85405245777b]
aws_eip.gw[1]: Refreshing state... [id=eipalloc-099b4b949859c1f72]
aws_route.internet_access: Refreshing state... [id=r-rtb-0b3e3a4a890bf1d421080289494]
aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:119548518081:loadbalancer/app/BPCalc-Stage-LB/9cfc631f9a8b8c46]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0bb5f9ea542a922fe]
aws_nat_gateway.gw[1]: Refreshing state... [id=nat-0a1f5a065c5eccec3]
aws_nat_gateway.gw[0]: Refreshing state... [id=nat-03ac49c6da6faebb3]
aws_route_table.private[1]: Refreshing state... [id=rtb-03ef665d610c0dd53]
aws_route_table.private[0]: Refreshing state... [id=rtb-0088b5e6cadf7fcc5]
aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:119548518081:listener/app/BPCalc-Stage-LB/9cfc631f9a8b8c46/53d34360b64df93b]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:119548518081:service/BPCalc-Stage/BPCalc-StageRolling]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b356f6e98ee12b64]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-062d89cd52f7697e0]
aws_appautoscaling_target.target: Refreshing state... [id=service/BPCalc-Stage/BPCalc-StageRolling]
aws_appautoscaling_policy.down: Refreshing state... [id=BPCalc_Stage_scale_down]
aws_appautoscaling_policy.up: Refreshing state... [id=BPCalc_Stage_scale_up]
aws_cloudwatch_metric_alarm.service_cpu_low: Refreshing state... [id=BPCalc_Stage_cpu_utilization_low]
aws_cloudwatch_metric_alarm.service_cpu_high: Refreshing state... [id=BPClac_Stage_cpu_utilization_high]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group.ecs_tasks has been changed
  ~ resource "aws_security_group" "ecs_tasks" {
        id                     = "sg-0bb5f9ea542a922fe"
        name                   = "bpcalc-ecs-tasks-security-group"
      + tags                   = {}
        # (7 unchanged attributes hidden)
    }
  # aws_vpc.main has been changed
  ~ resource "aws_vpc" "main" {
        id                               = "vpc-0505ebd4ac5f1e3a8"
      + tags                             = {}
        # (14 unchanged attributes hidden)
    }
  # aws_alb.main has been changed
  ~ resource "aws_alb" "main" {
        id                         = "arn:aws:elasticloadbalancing:eu-west-1:119548518081:loadbalancer/app/BPCalc-Stage-LB/9cfc631f9a8b8c46"
        name                       = "BPCalc-Stage-LB"
      + tags                       = {}
        # (14 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }
  # aws_ecs_service.main has been changed
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-west-1:119548518081:service/BPCalc-Stage/BPCalc-StageRolling"
        name                               = "BPCalc-StageRolling"
      + tags                               = {}
        # (13 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # aws_ecs_cluster.main has been changed
  ~ resource "aws_ecs_cluster" "main" {
      + capacity_providers = []
        id                 = "arn:aws:ecs:eu-west-1:119548518081:cluster/BPCalc-Stage"
        name               = "BPCalc-Stage"
      + tags               = {}
        # (1 unchanged attribute hidden)
    }
  # aws_eip.gw[1] has been changed
  ~ resource "aws_eip" "gw" {
      + association_id       = "eipassoc-0890a4dfe59562d79"
        id                   = "eipalloc-099b4b949859c1f72"
      + network_interface    = "eni-0cd35d140ca5d83fb"
      + private_dns          = "ip-172-17-3-61.eu-west-1.compute.internal"
      + private_ip           = "172.17.3.61"
      + tags                 = {}
        # (6 unchanged attributes hidden)
    }
  # aws_eip.gw[0] has been changed
  ~ resource "aws_eip" "gw" {
      + association_id       = "eipassoc-09606e8ef91f4f768"
        id                   = "eipalloc-0609c85405245777b"
      + network_interface    = "eni-05dd7b0a8d620d354"
      + private_dns          = "ip-172-17-2-232.eu-west-1.compute.internal"
      + private_ip           = "172.17.2.232"
      + tags                 = {}
        # (6 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.service_cpu_low has been changed
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
        id                        = "BPCalc_Stage_cpu_utilization_low"
      + insufficient_data_actions = []
      + ok_actions                = []
      + tags                      = {}
        # (14 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.service_cpu_high has been changed
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
        id                        = "BPClac_Stage_cpu_utilization_high"
      + insufficient_data_actions = []
      + ok_actions                = []
      + tags                      = {}
        # (14 unchanged attributes hidden)
    }
  # aws_alb_target_group.app has been changed
  ~ resource "aws_alb_target_group" "app" {
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:119548518081:targetgroup/BPCalc-Stage-TG/a4ff0a7441c913a6"
        name                               = "BPCalc-Stage-TG"
      + tags                               = {}
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_subnet.private[0] has been changed
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-02fb27c18a4431755"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_subnet.private[1] has been changed
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-09266f463901736fd"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_iam_role.ecs_task_execution_role has been changed
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "myEcsTaskExecutionRole"
        name                  = "myEcsTaskExecutionRole"
      + tags                  = {}
        # (7 unchanged attributes hidden)
    }
  # aws_security_group.lb has been changed
  ~ resource "aws_security_group" "lb" {
        id                     = "sg-0b575e069f77939d7"
        name                   = "bpcalc-stage-load-balancer-security-group"
      + tags                   = {}
        # (7 unchanged attributes hidden)
    }
  # aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0088b5e6cadf7fcc5"
      + tags             = {}
        # (4 unchanged attributes hidden)
    }
  # aws_route_table.private[1] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-03ef665d610c0dd53"
      + tags             = {}
        # (4 unchanged attributes hidden)
    }
  # aws_nat_gateway.gw[1] has been changed
  ~ resource "aws_nat_gateway" "gw" {
        id                   = "nat-0a1f5a065c5eccec3"
      + tags                 = {}
        # (5 unchanged attributes hidden)
    }
  # aws_nat_gateway.gw[0] has been changed
  ~ resource "aws_nat_gateway" "gw" {
        id                   = "nat-03ac49c6da6faebb3"
      + tags                 = {}
        # (5 unchanged attributes hidden)
    }
  # aws_subnet.public[0] has been changed
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0fc00b1d35b6ac97f"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_subnet.public[1] has been changed
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-05035389b316e29b4"
      + tags                            = {}
        # (8 unchanged attributes hidden)
    }
  # aws_internet_gateway.gw has been changed
  ~ resource "aws_internet_gateway" "gw" {
        id       = "igw-099c275c5e220ade3"
      + tags     = {}
        # (3 unchanged attributes hidden)
    }
  # aws_ecs_task_definition.app has been changed
  ~ resource "aws_ecs_task_definition" "app" {
        id                       = "BPCalc-task"
      + tags                     = {}
        # (9 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.down must be replaced
-/+ resource "aws_appautoscaling_policy" "down" {
      ~ arn                = "arn:aws:autoscaling:eu-west-1:119548518081:scalingPolicy:a8ce1553-7af4-43d8-bb64-4eed4ee52e02:resource/ecs/service/BPCalc-Stage/BPCalc-StageRolling:policyName/BPCalc_Stage_scale_down" -> (known after apply)
      ~ id                 = "BPCalc_Stage_scale_down" -> (known after apply)
        name               = "BPCalc_Stage_scale_down"
      ~ resource_id        = "service/BPCalc-Stage/BPCalc-StageRolling" -> "service/BPCalc-Stage/BPCalcStageRolling" # forces replacement
        # (3 unchanged attributes hidden)

      ~ step_scaling_policy_configuration {
          - min_adjustment_magnitude = 0 -> null
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_appautoscaling_policy.up must be replaced
-/+ resource "aws_appautoscaling_policy" "up" {
      ~ arn                = "arn:aws:autoscaling:eu-west-1:119548518081:scalingPolicy:a8ce1553-7af4-43d8-bb64-4eed4ee52e02:resource/ecs/service/BPCalc-Stage/BPCalc-StageRolling:policyName/BPCalc_Stage_scale_up" -> (known after apply)
      ~ id                 = "BPCalc_Stage_scale_up" -> (known after apply)
        name               = "BPCalc_Stage_scale_up"
      ~ resource_id        = "service/BPCalc-Stage/BPCalc-StageRolling" -> "service/BPCalc-Stage/BPCalcStageRolling" # forces replacement
        # (3 unchanged attributes hidden)

      ~ step_scaling_policy_configuration {
          - min_adjustment_magnitude = 0 -> null
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_appautoscaling_target.target must be replaced
-/+ resource "aws_appautoscaling_target" "target" {
      ~ id                 = "service/BPCalc-Stage/BPCalc-StageRolling" -> (known after apply)
      ~ resource_id        = "service/BPCalc-Stage/BPCalc-StageRolling" -> "service/BPCalc-Stage/BPCalcStageRolling" # forces replacement
      ~ role_arn           = "arn:aws:iam::119548518081:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:eu-west-1:119548518081:scalingPolicy:a8ce1553-7af4-43d8-bb64-4eed4ee52e02:resource/ecs/service/BPCalc-Stage/BPCalc-StageRolling:policyName/BPCalc_Stage_scale_up",
        ] -> (known after apply)
      ~ dimensions                = {
          ~ "ServiceName" = "BPCalc-StageRolling" -> "BPCalcStageRolling"
            # (1 unchanged element hidden)
        }
        id                        = "BPClac_Stage_cpu_utilization_high"
        tags                      = {}
        # (14 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.service_cpu_low will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:eu-west-1:119548518081:scalingPolicy:a8ce1553-7af4-43d8-bb64-4eed4ee52e02:resource/ecs/service/BPCalc-Stage/BPCalc-StageRolling:policyName/BPCalc_Stage_scale_down",
        ] -> (known after apply)
      ~ dimensions                = {
          ~ "ServiceName" = "BPCalc-StageRolling" -> "BPCalcStageRolling"
            # (1 unchanged element hidden)
        }
        id                        = "BPCalc_Stage_cpu_utilization_low"
        tags                      = {}
        # (14 unchanged attributes hidden)
    }

  # aws_ecs_service.main must be replaced
-/+ resource "aws_ecs_service" "main" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-west-1:119548518081:service/BPCalc-Stage/BPCalc-StageRolling" -> (known after apply)
      ~ name                               = "BPCalc-StageRolling" -> "BPCalcStageRolling" # forces replacement
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:119548518081:task-definition/BPCalc-task:3" -> (known after apply)
        # (8 unchanged attributes hidden)

      - deployment_controller {
          - type = "ECS" -> null
        }


        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:119548518081:task-definition/BPCalc-task:3" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment      = [] -> null
                  - essential        = true -> null
                  ~ logConfiguration = {
                      ~ options   = {
                          ~ awslogs-group         = "/ecs/cb-app" -> "/ecs/BPCalc-Stage-app"
                            # (2 unchanged elements hidden)
                        }
                        # (1 unchanged element hidden)
                    }
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "BPCalc-task" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 5 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @davidpmahon, Action: `pull_request`*